app/controllers/api/v1/items_controller.rb

SELECT `items`.* FROM `items` ORDER BY `items`.`created_at` DESC
---
      def index
        items = Item.order(created_at: :desc)