app/controllers/api/v1/items_controller.rb

      def index
        items = Item.order(cerated_at: : desc)
---
SELECT `items`.* FROM `items` ORDER BY `cerated_at` DESC