app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def json
    render :json => Item.all

INSERT INTO "items" ("image", "title", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "image" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image", "#<ActionDispatch::Http::UploadedFile:0x00007fe0c4ecf520>"], ["updated_at", "2019-10-16 05:49:03.198799"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)