app/models/user.rb

  def self.find_for_github_oauth(auth, signed_in_resource=nil)
    user = User.find_by(provider: auth.provider, uid: auth.uid)
---
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'github' AND `users`.`uid` = '56285212' LIMIT 1